src/Catalogs/ВидыПлановКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыПлановКомпании</Name>
			<Comment>Виды планов при планировании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ВидыПлановКомпании</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Comment>Периодичность заполнения и сверки плановых и фактических документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаПланирования</Name>
					<Comment>Используется для фильтрации состава аналитических объектов в обработках заполнения</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования1</Name>
					<Comment>Тип первого аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАналитикиПланирования2</Name>
					<Comment>Тип второго аналитического реквизита таблицы план-фактных документов</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитическиеРазрезыПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана1</Name>
					<Comment>Наименование первого числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана2</Name>
					<Comment>Наименование второго числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПлана3</Name>
					<Comment>Наименование третьего числового показателя документов планирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПлана</Name>
					<Comment>Список параметров плановых документов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Параметр планового документа</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Comment>Тип значения параметра планового документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазовыеПланы</Name>
					<Comment>Список видов планов, от которых зависит заполнение планов данного вида</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлана</Name>
							<Comment>Вид плана, от которого зависит данный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлановКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗависимости</Name>
							<Comment>По своему подразделению, по вложенным подразделениям, по родительскому подразделению</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗависимостейПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборОбъектаПланированияПоАналитике</Name>
							<Comment>Объект планирования не связан с базовым по объекту планирования, или номер аналитики базового плана</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Табличная часть, содержащая список подразделений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Подразделение компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаПлана</Name>
							<Comment>Количество дней отсрочки плана от начала периода планирования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтсрочкаФакта</Name>
							<Comment>Количество дней отсрочки факта от конца периода планирования для расчета факта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыИОбработки</Name>
					<Comment>Перечень отчетов и обработок, связанных с данным объектом</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Comment>Наименование отчета / обработки для интерактивного выбора</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКОбъекту</Name>
							<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияПлана</Name>
							<Comment>Признак наличия процедуры заполнения планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагПроверкиПлана</Name>
							<Comment>Признак наличия процедуры проверки планового документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагЗаполненияФакта</Name>
							<Comment>Признак наличия процедуры заполнения фактического документа по установленным параметрам</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыборВидаОбъекта</Name>
							<Comment>Переключатель типа и местонахождения объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыЗависимостейПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗависимостейПланов</Name>
			<Comment>По своему подразделению, по вложенным подразделениям, по родительскому подразделению</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСвоемуПодразделению</Name>
					<Comment>По своему подразделению</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВложеннымПодразделениям</Name>
					<Comment>По вложенным подразделениям</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРодительскомуПодразделению</Name>
					<Comment>По родительскому подразделению</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыПлановКомпании/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Виды планов компании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Имя, Наименование, Код, Периодичность, ВидОбъектаПланирования,
		// ВидАналитикиПланирования1, ВидАналитикиПланирования2, ПоказательПлана1, ПоказательПлана2,
		// ПоказательПлана3, Параметры.
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрПериодичность = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрВидОбъектаПланирования = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрВидАналитикиПланирования1 = СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрВидАналитикиПланирования2 = СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		СтрПоказательПлана1 = СокрЛП(Макет.Область(НомерСтроки,8).Текст);
		СтрПоказательПлана2 = СокрЛП(Макет.Область(НомерСтроки,9).Текст);
		СтрПоказательПлана3 = СокрЛП(Макет.Область(НомерСтроки,10).Текст);
		СтрСсылкаОтчетыИОбработки = СокрЛП(Макет.Область(НомерСтроки,11).Текст);
		СтрСсылкаПараметрыПлана = СокрЛП(Макет.Область(НомерСтроки,12).Текст);
		СтрСсылкаБазовыеПланы = СокрЛП(Макет.Область(НомерСтроки,13).Текст);
		
		// получим элемент вида плана
		СсылкаВидПлана = Справочники.ВидыПлановКомпании[СтрИмя];
		Если СсылкаВидПлана.Пустая() Тогда
			ВывестиСообщение(НСтр("ru='Справочник ""Ошибка при заполнении вида плана ""%1"". Указан отсутствующий элемент справочника виды планов.'"),,,,,СтрНаименование);
			Продолжить;
		Иначе
			ОбъектВидПлана = СсылкаВидПлана.ПолучитьОбъект();
		КонецЕсли;
		
		// заполняем реквизиты
		ОбъектВидПлана.Наименование = СтрНаименование;
		
		// Получим периодичность планирования
		Если ЗначениеЗаполнено(СтрПериодичность) Тогда
			СсылкаПериодичность = Перечисления.ПериодичностьАнализаНакопительныхСкидок[СтрПериодичность];
			Если СсылкаПериодичность.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении периодичности планирования элемента: ""%1"". Значение периодичности: ""%2"" не найдено'"),,,,,СтрНаименование,СтрПериодичность);
			Иначе
				ОбъектВидПлана.ПериодичностьПланирования = СсылкаПериодичность;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru='Ошибка при заполнении периодичности планирования элемента: ""%1"". Значение периодичности: ""%2"" не найдено'"),,,,,СтрНаименование,СтрПериодичность);
		КонецЕсли;
		
		// Получим Вид объекта планирования
		Если ЗначениеЗаполнено(СтрВидОбъектаПланирования) Тогда
			СсылкаАналитическиеРазрезыПланирования = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидОбъектаПланирования];
			Если СсылкаАналитическиеРазрезыПланирования.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида объекта планирования элемента:  ""%1"". Вид объекта планирования: ""%2"" не найден'"),,,,,СтрНаименование,СтрВидОбъектаПланирования);
			Иначе
				ОбъектВидПлана.ВидОбъектаПланирования = СсылкаАналитическиеРазрезыПланирования;
			КонецЕсли;
		КонецЕсли;
		
		// Получим Вид аналитики планирования1
		Если ЗначениеЗаполнено(СтрВидАналитикиПланирования1) Тогда
			СсылкаВидАналитикиПланирования1 = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидАналитикиПланирования1];
			Если СсылкаВидАналитикиПланирования1.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида аналитики планирования 1 элемента:  ""%1"". Вид аналитики планирования: ""%2"" не найдено'"),,,,,СтрНаименование,СтрВидАналитикиПланирования1);
			Иначе
				ОбъектВидПлана.ВидАналитикиПланирования1 = СсылкаВидАналитикиПланирования1;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида аналитики планирования 1 элемента:  ""%1"". Вид аналитики планирования: ""%2"" не найдено'"),,,,,СтрНаименование,СтрВидАналитикиПланирования1);
		КонецЕсли;
		
		// Получим Вид аналитики планирования2
		Если ЗначениеЗаполнено(СтрВидАналитикиПланирования2) Тогда
			СсылкаВидАналитикиПланирования2 = ПланыВидовХарактеристик.АналитическиеРазрезыПланирования[СтрВидАналитикиПланирования2];
			Если СсылкаВидАналитикиПланирования2.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида аналитики планирования 2 элемента:  ""%1"". Вид аналитики планирования: ""%2"" не найдено'"),,,,,СтрНаименование,СтрВидАналитикиПланирования2);
			Иначе
				ОбъектВидПлана.ВидАналитикиПланирования2 = СсылкаВидАналитикиПланирования2;
			КонецЕсли;
		КонецЕсли;
		
		// заполним показатели плана
		ОбъектВидПлана.ПоказательПлана1 = СтрПоказательПлана1;
		ОбъектВидПлана.ПоказательПлана2 = СтрПоказательПлана2;
		ОбъектВидПлана.ПоказательПлана3 = СтрПоказательПлана3;
		ОбъектВидПлана.ПараметрыПлана.Очистить();
		ОбъектВидПлана.ОтчетыИОбработки.Очистить();
		ОбъектВидПлана.БазовыеПланы.Очистить();
		
		// Получим макет табличных частей
		МакетТабличнойЧасти = ПолучитьМакет("НастройкиПоУмолчаниюТабличныхЧастей");
		Если МакетТабличнойЧасти = Неопределено Тогда
			ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"));
			Возврат;
		КонецЕсли;
		
		// Заполним табличную часть параметры плана
		Если ЗначениеЗаполнено(СтрСсылкаПараметрыПлана) Тогда
			ТабличнаяЧастьПараметрыПлана=ОбъектВидПлана.ПараметрыПлана;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаПараметрыПлана);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				ВидПараметра=ПланыВидовХарактеристик.ПараметрыПланирования[СтрРеквизит1];
				Если ВидПараметра.Пустая() Тогда
					ВывестиСообщение(НСтр("ru='Ошибка при заполнении таблицы параметров планирования:  ""%1"" параметр планирования: ""%2"" не найден в ПВХ'"),,,,,СтрНаименование,СтрРеквизит1);
				КонецЕсли;
				ИмеющийсяВидПараметра=ОбъектВидПлана.ПараметрыПлана.Найти(ВидПараметра, "ВидПараметра"); 
				Если ИмеющийсяВидПараметра=Неопределено Тогда
					НоваяСтрока=ОбъектВидПлана.ПараметрыПлана.Добавить();
					НоваяСтрока.ВидПараметра=ВидПараметра;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
		// Заполним табличную часть БазовыеПланы
		Если ЗначениеЗаполнено(СтрСсылкаБазовыеПланы) Тогда
			ТабличнаяЧастьБазовыеПланы=ОбъектВидПлана.БазовыеПланы;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаБазовыеПланы);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				СтрРеквизит2 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,2).Текст);
				СтрРеквизит3 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,3).Текст);
				
				// заполняем табличную часть
				СсылкаВидПлана = Справочники.ВидыПлановКомпании[СтрРеквизит1];
				Если СсылкаВидПлана.Пустая() Тогда
					ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида плана элемента:  ""%1"". Вид плана: ""%2"" не найден'"),,,,,СтрНаименование,СтрРеквизит1);
				Иначе
					СтрокаТабличнойЧастиБазовыеПланы = ТабличнаяЧастьБазовыеПланы.Найти(СсылкаВидПлана,"ВидПлана");
					Если СтрокаТабличнойЧастиБазовыеПланы = Неопределено Тогда
						СтрокаТабличнойЧастиБазовыеПланы = ТабличнаяЧастьБазовыеПланы.Добавить();
					КонецЕсли;
					СтрокаТабличнойЧастиБазовыеПланы.ВидПлана=СсылкаВидПлана;
				КонецЕсли;
				Если СтрРеквизит2="ПоСвоемуПодразделению" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоСвоемуПодразделению;
				ИначеЕсли СтрРеквизит2="ПоВложеннымПодразделениям" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоВложеннымПодразделениям;
				ИначеЕсли СтрРеквизит2="ПоРодительскомуПодразделению" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВидЗависимости=Перечисления.ВидыЗависимостейПланов.ПоРодительскомуПодразделению;
				Иначе
					ВывестиСообщение(НСтр("ru='Ошибка при заполнении вида зависимости плана:  ""%1"". Вид зависимости плана: ""%2"" не найден'"),,,,,СтрНаименование,СтрРеквизит2);
				КонецЕсли;
				Если СтрРеквизит3="0" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
					СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=1;
				ИначеЕсли СтрРеквизит3="1" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
					СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=2;
				ИначеЕсли СтрРеквизит3="2" Тогда
					СтрокаТабличнойЧастиБазовыеПланы.ВыборОбъектаПланированияПоАналитике=СтрРеквизит3;
					СтрокаТабличнойЧастиБазовыеПланы.ОбъектПланированияПоАналитике=3;
				Иначе
					ВывестиСообщение(НСтр("ru='Ошибка при заполнении объекта планирования:  ""%1"".Объект планирования: ""%2"" не найден'"),,,,,СтрНаименование,СтрРеквизит3);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Заполним табличную часть ОтчетыИОбработки
		Если ЗначениеЗаполнено(СтрСсылкаОтчетыИОбработки) Тогда
			ТабличнаяЧастьОтчетыИОбработки=ОбъектВидПлана.ОтчетыИОбработки;
			ОбластьМакета = МакетТабличнойЧасти.ПолучитьОбласть(СтрСсылкаОтчетыИОбработки);
			Для НомерСтрокиТабл = 1 По ОбластьМакета.ВысотаТаблицы Цикл
				СтрРеквизит1 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,1).Текст);
				СтрРеквизит2 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,2).Текст);
				СтрРеквизит3 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,3).Текст);
				СтрРеквизит4 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,4).Текст);
				СтрРеквизит5 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,5).Текст);
				СтрРеквизит6 = СокрЛП(ОбластьМакета.Область(НомерСтрокиТабл,6).Текст);
				
				// Поищем в табличной части обработку с таким наименованием.
				СтрокаТабличнойЧастиОтчетыИОбработки = ТабличнаяЧастьОтчетыИОбработки.Найти(СтрРеквизит6,);
				Если СтрокаТабличнойЧастиОтчетыИОбработки = Неопределено Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки = ТабличнаяЧастьОтчетыИОбработки.Добавить();
				КонецЕсли;
				
				// Заполняем табличную часть
				Если СтрРеквизит1 = НСтр("ru = 'встроенный запрос из текстового макета'") Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ВидОбъекта = 1;
				КонецЕсли;
				Если СтрРеквизит1 = НСтр("ru = 'внешний запрос из текстового файла'") Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ВидОбъекта = 2;
				КонецЕсли;
				Если СтрРеквизит1 = НСтр("ru = 'встроенная обработка'")Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ВидОбъекта = 3;
				КонецЕсли;
				Если СтрРеквизит1 = НСтр("ru = 'внешняя обработка'") Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ВидОбъекта = 4;
				КонецЕсли;
				СтрокаТабличнойЧастиОтчетыИОбработки.ПутьКОбъекту = СтрРеквизит2;
				Если СтрРеквизит3 = "Истина" Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагЗаполненияПлана = Истина;
				Иначе
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагЗаполненияПлана = Ложь;
				КонецЕсли;
				Если СтрРеквизит4 = "Истина" Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагЗаполненияФакта = Истина;
				Иначе
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагЗаполненияФакта = Ложь;
				КонецЕсли;
				Если СтрРеквизит5 = "Истина" Тогда
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагПроверкиПлана = Истина;
				Иначе
					СтрокаТабличнойЧастиОтчетыИОбработки.ФлагПроверкиПлана = Ложь;
				КонецЕсли;
				СтрокаТабличнойЧастиОтчетыИОбработки.Наименование = СтрРеквизит6;
			КонецЦикла;
		КонецЕсли;
		
		// Сохранение справочника
		НовыйЭлемент = ОбъектВидПлана.ЭтоНовый();
		Если ОбъектВидПлана.Модифицированность() Тогда
			Попытка
				ОбъектВидПлана.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Виды планов компании"". ""%1"" элемент ""%2"" не найден'"),,,,,?(НовыйЭлемент,"Создан","Модифицирован"),СокрЛП(ОбъектВидПлана.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Виды планов компании""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Обработка пересчета табличных частей объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаТабличнойЧастиОтчетыИОбработки(Объект, ПараметрыДействия) Экспорт
	
	Для Каждого ТекСтрокаОтчетыИОбработки Из Объект.ОтчетыИОбработки Цикл
		Если ТекСтрокаОтчетыИОбработки.ВидОбъекта=1 Тогда
			Если ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта<>НСтр("ru = 'встроенный запрос из текстового макета'") Тогда
				ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта=НСтр("ru = 'встроенный запрос из текстового макета'");
			КонецЕсли;
		ИначеЕсли ТекСтрокаОтчетыИОбработки.ВидОбъекта=2 Тогда
			Если ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта<>НСтр("ru = 'внешний запрос из текстового файла'") Тогда
				ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта=НСтр("ru = 'внешний запрос из текстового файла'");
			КонецЕсли;
		ИначеЕсли ТекСтрокаОтчетыИОбработки.ВидОбъекта=3 Тогда
			Если ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта<>НСтр("ru = 'встроенная обработка'") Тогда
				ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта=НСтр("ru = 'встроенная обработка'");
			КонецЕсли;
		ИначеЕсли ТекСтрокаОтчетыИОбработки.ВидОбъекта=4 Тогда
			Если ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта<>НСтр("ru = 'внешняя обработка'") Тогда
				ТекСтрокаОтчетыИОбработки.ВыборВидаОбъекта=НСтр("ru = 'внешняя обработка'");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПересчетаТабличнойЧастиОтчетыИОбработки()

// Обработка пересчета табличных частей объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаТабличнойЧастиБазовыеПланы(Объект, ПараметрыДействия) Экспорт
	
	Для Каждого ТекСтрокаБазовыеПланы Из Объект.БазовыеПланы Цикл
		Если ТекСтрокаБазовыеПланы.ОбъектПланированияПоАналитике=1 Тогда
			Если ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике<> НСтр("ru = 'объект планирования не связан с базовым по объекту планирования'") Тогда
				ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'объект планирования не связан с базовым по объекту планирования'");
			КонецЕсли;
		ИначеЕсли ТекСтрокаБазовыеПланы.ОбъектПланированияПоАналитике=2 Тогда
			Если ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике<> НСтр("ru = 'первый номер аналитики базового плана'") Тогда
				ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'первый номер аналитики базового плана'");
			КонецЕсли;
		ИначеЕсли ТекСтрокаБазовыеПланы.ОбъектПланированияПоАналитике=3 Тогда
			Если ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике<> НСтр("ru = 'второй номер аналитики базового плана'") Тогда
				ТекСтрокаБазовыеПланы.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'второй номер аналитики базового плана'");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПересчетаТабличнойЧастиБазовыеПланы()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ОтчетыИОбработки.Наименование");
		ОбязательныеРеквизиты.Добавить("БазовыеПланы.ВидПлана");
		ОбязательныеРеквизиты.Добавить("Подразделения.Подразделение");
		ОбязательныеРеквизиты.Добавить("ПараметрыПлана.ВидПараметра");
		ОбязательныеРеквизиты.Добавить("ПериодичностьПланирования");
		ОбязательныеРеквизиты.Добавить("ВидАналитикиПланирования1");
		ОбязательныеРеквизиты.Добавить("ПоказательПлана1");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидАналитикиПланирования1");
	Результат.Добавить("ВидАналитикиПланирования2");
	Результат.Добавить("ПоказательПлана1");
	Результат.Добавить("ПоказательПлана2");
	Результат.Добавить("ПоказательПлана3");
	Результат.Добавить("ПериодичностьПланирования");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "БАЗОВЫЕ ПЛАНЫ"

// Обработчик события возникающего при изменении данных реквизита "Выбор объекта планирования по аналитике" 
// в таблице "Базовые планы".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении(Объект, Строка) Экспорт
	
	Если Строка.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'объект планирования не связан с базовым по объекту планирования'") Тогда
		Строка.ОбъектПланированияПоАналитике=1;
	ИначеЕсли Строка.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'первый номер аналитики базового плана'") Тогда
		Строка.ОбъектПланированияПоАналитике=2;
	ИначеЕсли Строка.ВыборОбъектаПланированияПоАналитике= НСтр("ru = 'второй номер аналитики базового плана'") Тогда
		Строка.ОбъектПланированияПоАналитике=3;
	КонецЕсли;
	
КонецПроцедуры // БазовыеПланыВыборОбъектаПланированияПоАналитикеПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ОТЧЕТЫ И ОБРАБОТКИ"

// Обработчик события возникающего при изменении данных реквизита "Выбор вида объекта" в таблице "Отчеты и обработки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ОтчетыИОбработкиВыборВидаОбъектаПриИзменении(Объект, Строка) Экспорт
	
	Если Строка.ВыборВидаОбъекта= НСтр("ru = 'встроенный запрос из текстового макета'") Тогда
		Строка.ВидОбъекта=1;
	ИначеЕсли Строка.ВыборВидаОбъекта= НСтр("ru = 'внешний запрос из текстового файла'") Тогда
		Строка.ВидОбъекта=2;
	ИначеЕсли Строка.ВыборВидаОбъекта= НСтр("ru = 'встроенная обработка'") Тогда
		Строка.ВидОбъекта=3;
	Иначе
		Строка.ВидОбъекта=4;
	КонецЕсли;
	Строка.ФлагЗаполненияПлана = Ложь;
	Строка.ФлагПроверкиПлана = Ложь;
	Строка.ФлагЗаполненияФакта = Ложь;
	
КонецПроцедуры // ОтчетыИОбработкиВыборВидаОбъектаПриИзменении()

// Обработчик события возникающего при изменении данных реквизитов "Флаг заполнения факта",
// "Флаг проверки плана", "Флаг заполнения плана" в таблице "Отчеты и обработки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Функция ОтчетыИОбработкиФлагПриИзменении(Объект, Строка) Экспорт
	
	Если Строка.ВидОбъекта=1 ИЛИ Строка.ВидОбъекта=2 Тогда
		КоличествоОтмеченныхФлажков=0;
		Если Строка.ФлагЗаполненияПлана=Истина Тогда
			КоличествоОтмеченныхФлажков=КоличествоОтмеченныхФлажков+1;
		КонецЕсли;
		Если Строка.ФлагПроверкиПлана=Истина Тогда
			КоличествоОтмеченныхФлажков=КоличествоОтмеченныхФлажков+1;
		КонецЕсли;
		Если Строка.ФлагЗаполненияФакта=Истина Тогда
			КоличествоОтмеченныхФлажков=КоличествоОтмеченныхФлажков+1;
		КонецЕсли;
		Если КоличествоОтмеченныхФлажков>=2 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции // ОтчетыИОбработкиФлагПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
